{
  "bullets": [
    {
      "text": "Fed and FDIC released public sections of large-bank resolution plans, signaling continued focus on resolvability, liquidity, and living wills for systemic institutions.",
      "tags": [
        "macro",
        "markets"
      ],
      "link": "https://www.federalreserve.gov/newsevents/pressreleases/bcreg20251023a.htm"
    },
    {
      "text": "U.S. ratchets up sanctions on Russia’s oil sector, targeting ship-to-ship transfers, insurers, and refiners to squeeze revenues and enforce price caps; Europe coordinating new pressure.",
      "tags": [
        "energy",
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/10/23/us/politics/trump-sanctions-russian-oil.html"
    },
    {
      "text": "Washington mulls software-linked export controls on China, signaling broader tech restrictions ahead of Trump–Xi meeting; Asia markets rose on hopes of dialogue.",
      "tags": [
        "geopolitics",
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/10/23/us-china-software-export-curbs-bessent-trump-xi-meeting.html"
    },
    {
      "text": "Google and Anthropic sign cloud deal worth tens of billions, validating TPU demand and intensifying hyperscaler AI competition and capex.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/10/23/anthropic-google-cloud-deal-tpu.html"
    },
    {
      "text": "Intel beats on sales; turnaround stabilizing under government stake. Focus shifts to foundry progress as investors reassess U.S.-backed semiconductor strategy.",
      "tags": [
        "markets",
        "tech"
      ],
      "link": "https://www.cnbc.com/2025/10/23/intel-intc-earnings-report-q3-2025-.html"
    },
    {
      "text": "Ford beat earnings but cut 2025 guidance; pausing F-150 Lightning expansion and redeploying EV workers highlight cautious pivot amid demand and supply disruptions.",
      "tags": [
        "markets",
        "tech",
        "energy"
      ],
      "link": "https://www.cnbc.com/2025/10/23/ford-motor-earnings-q3-2025.html"
    },
    {
      "text": "Target to cut 1,800 corporate jobs amid sales slump, its first major layoffs in a decade, signaling continued pressure on big-box retail margins.",
      "tags": [
        "markets",
        "macro"
      ],
      "link": "https://www.cnbc.com/2025/10/23/target-layoffs-corporate-jobs-sales-slump.html"
    },
    {
      "text": "Apple begins shipping American-made AI servers from Texas, underscoring U.S. reshoring and surging enterprise demand for on-premise AI infrastructure.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/10/23/apple-american-made-ai-servers-texas.html"
    },
    {
      "text": "Trump pardons Binance founder Changpeng Zhao, potentially resetting U.S. crypto enforcement posture and unlocking industry expansion domestically.",
      "tags": [
        "markets",
        "tech"
      ],
      "link": "https://www.cnbc.com/2025/10/23/trump-pardons-binance-founder-cz-zhao.html"
    },
    {
      "text": "Existing-home sales rose on lower mortgage rates, but prices remain near records, highlighting affordability constraints despite easing rate pressure.",
      "tags": [
        "macro",
        "rates",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/10/23/lower-mortgage-rates-push-home-sales-higher-in-september.html"
    },
    {
      "text": "U.S. explores UN mandate for Gaza security force while ruling out West Bank annexation, signaling a calibrated Middle East posture with coalition-building focus.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/10/23/world/middleeast/rubio-israel-gaza.html"
    },
    {
      "text": "Experimental therapy cut LDL cholesterol nearly 50% without statins or notable side effects, pointing to a potential paradigm shift in cardiovascular disease management.",
      "tags": [
        "science"
      ],
      "link": "https://www.sciencedaily.com/releases/2025/10/251022023122.htm"
    }
  ]
}