{
  "bullets": [
    {
      "text": "Trump administration offers policy support to slow coal-plant closures, potentially raising power-sector emissions and complicating utilities’ transition economics.",
      "tags": [
        "energy",
        "macro"
      ],
      "link": "https://www.nytimes.com/2025/12/24/climate/coal-plant-closures-indiana.html"
    },
    {
      "text": "Harvard and the Trump administration escalate a high-stakes dispute, signaling tighter federal scrutiny of elite universities and potential funding/regulatory leverage.",
      "tags": [
        "geopolitics",
        "macro"
      ],
      "link": "https://www.nytimes.com/2025/12/24/us/trump-harvard-letters-deal.html"
    },
    {
      "text": "DOJ released more Epstein files and says over 1M additional potential records were newly uncovered, amplifying transparency, legal, and political risks.",
      "tags": [
        "geopolitics",
        "macro"
      ],
      "link": "https://www.cnbc.com/2025/12/24/epstein-files-senators-call-for-audit-into-dojs-release.html"
    },
    {
      "text": "Some DOJ redactions in Epstein documents are reportedly recoverable, exposing operational-security failures and increasing litigation and reputational fallout.",
      "tags": [
        "geopolitics",
        "tech"
      ],
      "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-redactions-doj.html"
    },
    {
      "text": "Honduras declares Nasry Asfura president; a Trump-aligned outcome may shift regional security, migration cooperation, and investment climate expectations.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/12/24/world/americas/honduras-election-results-asfura.html"
    },
    {
      "text": "Zelensky signals openness to pulling back troops in eastern Ukraine for a peace deal, implying possible de-escalation but contentious security guarantees.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/12/24/world/europe/zelensky-demilitarized-zone-offer.html"
    },
    {
      "text": "Hundreds of Gazans reportedly killed despite a two-month truce, underscoring cease-fire fragility and elevated regional escalation and humanitarian risks.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/12/24/world/middleeast/gaza-killings-israel-cease-fire.html"
    },
    {
      "text": "Extended U.S. aircraft-carrier deployment in the Caribbean pressures Venezuela but raises fiscal and readiness costs, signaling sustained coercive diplomacy.",
      "tags": [
        "geopolitics",
        "macro"
      ],
      "link": "https://www.nytimes.com/2025/12/24/us/politics/aircraft-carrier-deployment-caribbean-costs.html"
    },
    {
      "text": "Nvidia is reportedly buying Groq assets for about $20B and licensing its tech, consolidating AI-chip IP and intensifying competition with hyperscalers.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/12/24/nvidia-buying-ai-chip-startup-groq-for-about-$20-billion-biggest-deal.html"
    },
    {
      "text": "Amazon faces a strategic choice: resist AI shopping agents that disintermediate storefronts or embrace them, reshaping e-commerce margins and advertising power.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/12/24/amazon-faces-a-dilemma-fight-ai-shopping-agents-or-join-them.html"
    },
    {
      "text": "BP plans to sell 65% of its $10B Castrol unit, highlighting portfolio reshaping and capital recycling amid energy-transition and oil-cycle uncertainty.",
      "tags": [
        "energy",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/12/24/bp-to-sell-65percent-stake-in-10-billion-castrol-lubricants-to-stonepeak.html"
    },
    {
      "text": "China’s dominance in critical minerals boosts Western rare-earth magnet makers short-term, but supply-chain security remains a key industrial-policy driver.",
      "tags": [
        "geopolitics",
        "energy"
      ],
      "link": "https://www.cnbc.com/2025/12/24/critical-minerals-rare-earth-magnet-makers-relish-a-moment-in-the-sun.html"
    },
    {
      "text": "Scientists report reversing Alzheimer’s symptoms in mice and restoring memory, a promising mechanistic lead but far from validated human therapies.",
      "tags": [
        "science"
      ],
      "link": "https://www.sciencedaily.com/releases/2025/12/251224032354.htm"
    },
    {
      "text": "Studies suggest AI boosts scientific paper output while average quality slips, raising concerns for research evaluation, peer review integrity, and funding allocation.",
      "tags": [
        "science",
        "tech"
      ],
      "link": "https://www.sciencedaily.com/releases/2025/12/251224032347.htm"
    },
    {
      "text": "Research argues dietary choices materially influence climate and biodiversity outcomes, implying food-system policy and consumer behavior are major decarbonization levers.",
      "tags": [
        "science",
        "macro"
      ],
      "link": "https://www.sciencedaily.com/releases/2025/12/251224032356.htm"
    }
  ]
}