{
  "bullets": [
    {
      "text": "Trump–Zelensky talks aimed to advance a Ukraine peace deal, but core disputes still block agreement, keeping war-risk premium and sanctions uncertainty elevated.",
      "tags": [
        "geopolitics",
        "markets"
      ],
      "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-zelensky-peace-ukraine-putin.html"
    },
    {
      "text": "Ukraine’s mooted 20-point plan remains a framework with unresolved enforcement, security guarantees, and sequencing—key determinants of future aid flows and reconstruction financing.",
      "tags": [
        "geopolitics",
        "macro"
      ],
      "link": "https://www.nytimes.com/2025/12/24/world/europe/what-is-in-the-20-point-ukraine-peace-plan.html"
    },
    {
      "text": "Middle East outlook described as an inflection point; persistent conflict and shifting alliances raise volatility for energy routes, defense spending, and regional investment.",
      "tags": [
        "geopolitics",
        "energy"
      ],
      "link": "https://www.nytimes.com/2025/12/28/world/middleeast/future-of-mideast.html"
    },
    {
      "text": "Deadly protests in Syria over security underscore state fragility, complicating humanitarian operations and any credible path to stabilization, investment, or refugee returns.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/12/28/world/middleeast/syria-protests-alawite-two-killed.html"
    },
    {
      "text": "A U.S. “zero immigration” scenario implies tighter labor supply, slower potential growth, and higher wage inflation pressures—especially in services, agriculture, and caregiving.",
      "tags": [
        "macro"
      ],
      "link": "https://www.nytimes.com/2025/12/28/business/us-immigration-trump-1920s.html"
    },
    {
      "text": "Big Tech’s agenda under Trump centers on A.I., chips, and regulation; policy choices could reshape antitrust risk, government procurement, and capital spending in compute.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.nytimes.com/2025/12/28/technology/tech-trump.html"
    },
    {
      "text": "Trump–Petro tensions spotlight Colombia’s pivotal role in global cocaine supply; reduced cooperation could alter interdiction effectiveness and spill into trade and security ties.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2025/12/28/world/americas/colombia-drug-trade-trump-petro.html"
    },
    {
      "text": "Year-end markets: U.S. stock futures flat after strong multi-year gains; investors debate whether momentum can persist amid still-tight financial conditions.",
      "tags": [
        "markets",
        "macro"
      ],
      "link": "https://www.marketwatch.com/story/u-s-stock-futures-flat-as-investors-still-hope-to-start-2026-on-a-roll-84169caf"
    },
    {
      "text": "Quantum computing shows technical progress, but public-market payoffs remain uncertain; valuations may be most sensitive to near-term commercial milestones versus research headlines.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.marketwatch.com/story/quantum-computing-works-now-investors-will-see-if-the-stocks-do-too-630b5513"
    },
    {
      "text": "Restaurants’ 2025 best-seller was “value,” signaling sustained consumer price sensitivity; operators may face margin pressure without productivity gains or input-cost relief.",
      "tags": [
        "macro",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/12/28/value-meals-restaurants-mcdonalds-chilis-taco-bell.html"
    },
    {
      "text": "Coupang’s $1.1B user compensation for a data breach highlights rising cyber-liability, potential regulatory tightening, and material cash costs for consumer platforms.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2025/12/29/south-korea-retail-coupang-bon-kim-1-billion-trillion-won-data-breach-compensation-vouchers.html"
    },
    {
      "text": "A.I. datacenter demand is tightening chips and memory supply, risking higher device prices and reinforcing compute as a key inflation vector in electronics supply chains.",
      "tags": [
        "tech",
        "macro"
      ],
      "link": "https://www.npr.org/2025/12/28/nx-s1-5656190/ai-chips-memory-prices-ram"
    },
    {
      "text": "Hidden geothermal heat beneath Greenland could shift sea-level projections, affecting coastal risk pricing, insurance, and infrastructure planning.",
      "tags": [
        "science",
        "macro"
      ],
      "link": "https://www.sciencedaily.com/releases/2025/12/251227082724.htm"
    }
  ]
}