{
  "bullets": [
    {
      "text": "Iran unrest is being fueled by currency collapse and inflation, turning an economic crisis into nationwide political instability with regional spillover risks.",
      "tags": [
        "macro",
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2026/01/10/world/europe/iran-protests-economy-currency-collapse.html"
    },
    {
      "text": "Trump was briefed on options to strike Iran, raising odds of U.S.-Iran escalation amid internal Iranian turmoil and uncertain Western contingency planning.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-iran-strikes.html"
    },
    {
      "text": "U.S. launched major strikes on Islamic State targets in Syria, signaling ongoing counterterror posture and potential mission creep amid broader Middle East volatility.",
      "tags": [
        "geopolitics"
      ],
      "link": "https://www.nytimes.com/2026/01/10/us/politics/us-strikes-islamic-state-syria.html"
    },
    {
      "text": "Trump’s renewed Greenland interest is pushing Europe toward negotiation strategies, highlighting Arctic security and critical-minerals competition.",
      "tags": [
        "geopolitics",
        "energy"
      ],
      "link": "https://www.nytimes.com/2026/01/10/world/europe/trump-greenland-europe.html"
    },
    {
      "text": "Venezuela is courting U.S. involvement, including military help on a rogue ship; Big Oil signals investment interest contingent on sanctions and stability.",
      "tags": [
        "energy",
        "geopolitics"
      ],
      "link": "https://www.cnbc.com/2026/01/10/what-the-big-oil-executives-told-trump-about-investing-in-venezuela.html"
    },
    {
      "text": "Anti-ICE protests spread after a Minneapolis shooting; disinformation and politicized federal responses add domestic-security and governance risk.",
      "tags": [
        "geopolitics",
        "other"
      ],
      "link": "https://www.nytimes.com/2026/01/10/us/ice-shooting-protests-minnesota.html"
    },
    {
      "text": "AI memory (HBM) is effectively sold out, driving price spikes and reinforcing hardware bottlenecks that can constrain AI deployment timelines and margins.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2026/01/10/micron-ai-memory-shortage-hbm-nvidia-samsung.html"
    },
    {
      "text": "Debate over an “AI bubble” persists; simultaneously, economists describe a “hiring recession,” suggesting productivity optimism alongside soft labor demand.",
      "tags": [
        "tech",
        "macro",
        "markets"
      ],
      "link": "https://www.cnbc.com/2026/01/10/are-we-in-an-ai-bubble-tech-leaders-analysts.html"
    },
    {
      "text": "2026 could be a breakout year for oral obesity drugs, intensifying GLP-1 competition and reshaping pharma revenues, payer costs, and long-term healthcare utilization.",
      "tags": [
        "science",
        "markets"
      ],
      "link": "https://www.cnbc.com/2026/01/10/2026-is-the-year-of-obesity-pills-from-novo-nordisk-eli-lilly-.html"
    },
    {
      "text": "Crypto ATMs face tightening U.S. scrutiny over fraud, threatening a niche on-ramp and signaling broader consumer-protection regulation of retail crypto infrastructure.",
      "tags": [
        "markets",
        "tech"
      ],
      "link": "https://www.cnbc.com/2026/01/10/bitcoin-crypto-atm-scam-fraud-regulation.html"
    },
    {
      "text": "UK ordered Ofcom to explore encryption backdoors, escalating the security-vs-privacy fight and increasing compliance uncertainty for messaging platforms and cloud providers.",
      "tags": [
        "tech",
        "geopolitics"
      ],
      "link": "https://reclaimthenet.org/uk-orders-ofcom-to-explore-encryption-backdoors"
    },
    {
      "text": "Astronomy breakthroughs: Hubble evidence of Betelgeuse’s companion and a “ghost galaxy” imply improved stellar and dark-matter models, refining cosmological constraints.",
      "tags": [
        "science"
      ],
      "link": "https://www.sciencedaily.com/releases/2026/01/260109235153.htm"
    },
    {
      "text": "Biomedical findings link gut aging programs to cancer risk and show “young blood” slowing Alzheimer’s in mice, pointing to new longevity and neurodegeneration targets.",
      "tags": [
        "science"
      ],
      "link": "https://www.sciencedaily.com/releases/2026/01/260108231411.htm"
    }
  ]
}