{
  "bullets": [
    {
      "text": "2025 Shared National Credit review flags underwriting and monitoring risks in large syndicated loans, underscoring potential credit deterioration for big-bank and nonbank exposures.",
      "tags": [
        "macro",
        "markets"
      ],
      "link": "https://www.federalreserve.gov/newsevents/pressreleases/bcreg20260112a.htm"
    },
    {
      "text": "Justice Department probe of Fed Chair Powell heightens perceived political pressure on monetary policy, raising uncertainty around Fed independence and future policy decisions.",
      "tags": [
        "rates",
        "macro"
      ],
      "link": "https://www.cnbc.com/2026/01/12/fed-chair-powell-investigation.html"
    },
    {
      "text": "Markets show a 'Sell America' tilt: dollar weakens and gold surges as investors price institutional risk tied to Fed attacks and governance concerns.",
      "tags": [
        "markets",
        "macro"
      ],
      "link": "https://www.cnbc.com/2026/01/12/sell-america-trade-trump-powell-investigation.html"
    },
    {
      "text": "Fed officials signal limited urgency for near-term rate cuts, even as prominent investors argue policy should move toward ~3% to reduce growth and refinancing strain.",
      "tags": [
        "rates",
        "macro"
      ],
      "link": "https://www.marketwatch.com/story/blackrocks-rieder-repeats-his-view-that-fed-needs-to-bring-interest-rates-down-to-3-0c1a61d3"
    },
    {
      "text": "Proposal to cap credit-card APRs around 10% risks disrupting bank lending models; enforcement is unclear and could tighten consumer credit while pressuring bank earnings.",
      "tags": [
        "markets",
        "macro"
      ],
      "link": "https://www.cnbc.com/2026/01/12/trump-credit-card-interest-rate-cap.html"
    },
    {
      "text": "Trump threatens 25% tariffs on any country trading with Iran, elevating secondary-sanctions risk and increasing odds of oil price spikes if supply or shipping is disrupted.",
      "tags": [
        "geopolitics",
        "energy"
      ],
      "link": "https://www.cnbc.com/2026/01/12/trump-tariffs-iran-business.html"
    },
    {
      "text": "U.S.-Venezuela escalation highlights limits of U.S. plans for Venezuelan oil and exposes reliability questions around Russian-supplied air defenses after reported missile failures.",
      "tags": [
        "geopolitics",
        "energy"
      ],
      "link": "https://www.nytimes.com/2026/01/12/us/politics/trump-venezuela-oil-dominance-influence.html"
    },
    {
      "text": "Apple selects Google’s Gemini for Siri and on-device AI features, signaling a major platform partnership that reshapes mobile AI competition and expands Google’s model distribution.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2026/01/12/apple-google-ai-siri-gemini.html"
    },
    {
      "text": "Alphabet reaches $4 trillion market cap, reflecting investor concentration in AI leaders and expectations of monetization from cloud, search, and model ecosystem leverage.",
      "tags": [
        "markets",
        "tech"
      ],
      "link": "https://www.cnbc.com/2026/01/12/alphabet-4-trillion-market-cap.html"
    },
    {
      "text": "Meta plans 10–15% Reality Labs cuts while launching new AI infrastructure efforts; cost discipline and capital intensity remain central to its AI/VR strategy.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.nytimes.com/2026/01/12/technology/meta-layoffs-reality-labs.html"
    },
    {
      "text": "OpenAI’s Torch acquisition accelerates push into healthcare data workflows, intensifying competition with Anthropic and big tech to own clinical AI tooling and compliance-ready platforms.",
      "tags": [
        "tech",
        "markets"
      ],
      "link": "https://www.cnbc.com/2026/01/12/open-ai-torch-health-care-technology.html"
    },
    {
      "text": "Research identifies an early brain signal linked to Alzheimer’s risk, implying potential for earlier screening and larger future demand for diagnostics and preventive therapeutics.",
      "tags": [
        "science"
      ],
      "link": "https://www.sciencedaily.com/releases/2026/01/260112001041.htm"
    }
  ]
}